{"text": [{"anot": "春の あたたかい 日の こと、", "content": "\"koto\" means \"thing\", but it can be used to mean \"story\".\n\nThe kanji is 事, in cantonese \"si\" (pronounced like \"see\" in english), which in chinese would also be used as either story (gu si) or to mean a thing as well.\n\nIn English you might say, \"tell him that thing you told me the other day\".  So in this case, this phrase is literally translated: \"a story of a warm spring day\".\n\nTranslation:\nOn a warm spring day"}, {"anot": "わたしぶねに 二人の 小さな 子どもを つれた 女の旅人が のりました。", "content": "Vocab\nwatashibune = ferry. this is a compound word. \nわたす means to cross or pass\n\nふね means boat (the kanji for ofuna, no idea why its funa vs fune)\nThen when they're combined, japanese people add the \"ten ten\" (thats how japanese people say the 2 dots) and it goes from watashihune to watashibune.\nni = inside\nfutari no chiisa na kodomo = 2 small children\ntsureta = brought along, or led (to lead people into a crowd, or to take someone to a new place)\nonna = woman\ntabibito = traveler (also a compound word -- the second word is hito and then ten ten is added because its added on.  i know you know this kanji but just wanted to point out the joining pattern that causes the second word to be pronounced with the harder \"bito\" vs \"hito\")\n\nTranslation\nthe way to make sense of this sentence construction is that there's a huge chain of words that describes the traveler.\n\n[futarino chiisana kodomowo tsureta onnano] tabibito = \na traveler who was a woman that had brought along 2 small children.\n\nThen think of the sentence as\nwatashibune ni [description] no tabibitoga norimashita.\n\nwhich is just: \"a traveler rode in the ferry\"\n\nTranslation:\nA female traveler who had 2 small children with her was riding in the ferry."}, {"anot": "ふねが 出ようとすると、", "content": "Vocabulary:\nfune (ふね) = Boat. Reinforcing above, fune = the same kanji as ofuna (which means big boat)\nderu (でる) = link = leave. this is \"chuut\" in chinese, like chuut hao = exit. its also the same kanji as in the last chapter for \"toriDAsu\" -- when cat-san takes the hoozuki out of his hutokoro. deru and dasu are both valid pronunciations of this and it depends on context. deru is usually used to mean to exit, where the subject is taking the action. dasu is usually used to mean \"to take something out\", where the action is being performed on another object.\n\nPhrase/Usage pattern:\n[verb]-yoo to suru = as I was about to - [verb]\ntabeyoo to suru to XXX = as I was about to eat, XXX.\nnomoo to suru to XXX = as I was about to drink, XXX.\nhajimaroo to suru to XXX = as I was about to start, XXX\n \nTranslation:\nAs the vessel wa about to leave,"}, {"anot": "「おーい、 ちょっと まって くれ。」", "content": "Vocab\nChotto = a little\nmatte = matsu = wait\nkure = give.\n\nTranslation:\nHeeey! Wait a sec! / \"Give me a minute!\""}, {"anot": "と、 どての むこうから 手を ふりながら、さむらいが 一人 はしってきて", "content": "Translation:\nfrom the other side of the bank while waving his hands, a single samurai came running out.\n\nSo basically the samurai came running from the other side of the embankment with his arms waving as he said \"hey, hold one a sec!\"\n\nImportant Usage Pattern:\nXXX nagara == while XXX.\n\nThis pattern appeared in the last lesson -- page 6, while saying something (ii nagara), the cat was peeling the hoozuki and taking the flesh of the fruit out \n\nnagare = a current or flow, like in a river\nnagasu = to drain out, like a bath tub\n\nso you can think of this XXX nagara pattern as \"while in the flow/process of doing XXX, or during XXX\"\n\nexample: TV wo minagara, hirugohan wo tabeta: \"while watching TV, [someone] ate lunch\"\n"}, {"anot": "ふねに とびこみました。", "content": "Translation: [the samurai] jumped into the boat."}, {"anot": "さむらいは 船の まん中に どっかり すわっていました。", "content": "Translation: The samurai sat down at the center of the boat."}, {"anot": "ぽかぽか あたたかいので、そのうちにいねむりをはじめました。", "content": "Poka poka is one of those descriptive sounds in Japanese. in this case its the feeling you get on your skin when you're in a nice pleasant sun and its kind of warm and fuzzy.\n\nTranslation:\nBecause the sun was \"poka poka\" warm, shortly thereafter [the samurai] started sleeping."}], "title": "あめだま (Piece of Candy)"}